//#include<stdio.h>
//预处理

//int main()
//接下来是业务代码，int是整数，main()是主入口
//{
	//printf("WuYans vs tour");
	//printf是输出文本
	/*return 0;*/
	//return代表结束，0为正常停止，非0则异常停止
//}
//ctrl+k +ctrl+c是快捷注释
//若是要多行注释则选中多行再进行操作
//取消则是ctrl+k然后ctrl+u
//注释最好不要嵌套，且注释在运行过程中会进行注释擦除，及注释不参与运行
/*
关键字
关键字都是小写字母
一般有特殊颜色标记。vs一般是蓝色和紫色
*/
/* 

常量：其值永远不变的量
四大类：
整型常量：正数，负数，0
实型常量：带小数点的数字，且.93等同于0.93,18.等同于18.0
字符常量：字母，数字，英文符号。必须用单引号引起来，且引号里只能有一个
字符串常量：双引号引起来的，可以是一串，甚至双引号里面可以没有东西
*/
//若是要计算则是整型常量，不加引号，若是要打印出来，展示出来，则需要加引号
//''这是语法错误，什么都不是
//‘钞票那个符号’语法错误
//1.2340000*10的七次方，不是常量，而是一个计算过程
//判断变量类型时一定要看有没有空格，这是大坑啊



